trunk/fireFoam/testBatteryFireFOAM/coFlowFlame2D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            zeroGradient;
        //type            buoyantPressure;
        //value           uniform 101325;
    }

    sides
    {
/*
        type            uniformDensityHydrostaticPressure;
        rho             1.2;
        pRefValue       101325;
        pRefPoint       (0 0 0);
        value           $internalField;
*/
/*
        type            fixedValue;
        value           $internalField;
*/
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1.4;
        p0              $internalField;
        value           $internalField;
    }
    base
    {
        type            buoyantPressure;
        value           $internalField;
    }
    inlet
    {
        type            buoyantPressure;
        value           $internalField;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
