trunk/fireFoam/testBatteryFireFOAM/coFlowFlame2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 298.15;
        value           uniform 298.15;
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform 298.15;
        value           uniform 298.15;
    }
    base
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 298.15;
/*
        type            fixedEnthalpyFluxTemperature;
        value           uniform 298.15;
        Tinf            uniform 298.15;
*/
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
